#+STARTUP: content
#+PRIORITIES: 1 6 3 
#+TODO: TODO(t) DOIN(D) MYBE(M) WAIT(w) | DONE(d) CANC(c)
#+TODO: oliv(o) mary(m) regi(r) lind(i) lori(c) adam(a) nina(n) | done(q)
* Weekly's
** Oct 23rd
*** O Weekly Agenda
**** See Globalyzer Lite
** Nov 2nd
*** Company Meeting
**** DONE [#1] Send Lori link to Lite videos (Mainly VS)
CLOSED: [2015-11-02 Mon 16:31] DEADLINE: <2015-11-02 Mon>
***** Mention that developers must manually insert "// $NON-NLS-L$
*** Product team meeting
**** regi [#1] Olivier's list of things that need to happen prior to release
O's notes for Tue Nov 3:
11/10/2015
- [-] 4.8.5 Lite Release [11/17]
  - [X] Attributes of the jar for the Eclipse Clickable Console Plugin & license directory with EULA + 3rd party stuff
  - [X] Finalize JUnits
  - [X] Remove the "Eclipse-Enhanced"  option: gnu
  - [X] 0) Regina to test with Java 7 on 4.5  
  - [X] 1) Regina updates the docs for the Clickable Console
  - [X] 1) Michael checks for the documentation coherence
  - [X] (NEW) Review edits to documentation usage
  - [X] 2) Regina updates the docs with the supported versions
  - [X] 3) Michael & Regina to go over error messages
  - [X] (NEW) Any last bugs fixed
  - [X] (NEW) Michael proofs Regina's updates to the README
  - [ ] 4) Regina send Green Light Email
  - [ ] 5) O pushes the files on the installers & Let Adam know so he can PR
  - [ ] RELEASE HAPPENS HERE!
  - [ ] POST RELEASE!      
  - [ ] 4) Michael merges back both the help & code to trunk: & Send mail so M. can double check.
  - [ ] 5) Regina points the tests back to trunk (not 4.8.5)
** Nov 9th
*** Company Meeting
*** Product Team Meeting
*** TODO [#1] [1/8] Weekly Agenda Checklist 
- [X] Lite out
  - [X] HTML Last pass for IDE usage page
  - [X] Exit error code bug fixed
  - [X] Project Path bug figured out
  - [X] Project Path bug fixed (Not a bug)
- [ ] BB installation
- [-] Stack Installer - BB harvesting
- [ ] Wiki License Page
- [ ] EMC: attend meetings
- [ ] NetApp: Introduction
- [ ] Esri
- [ ] Give a Time Frame for a demo of the Lingoport Suite
* Globalyzer Lite
** DONE [#1] [9/9] Get Lite release ready                          :status meeting:
CLOSED: [2015-11-13 Fri 14:07]
*** DONE [#1] [0/0] Look into lite eclipse click-ability     :status meeting:
CLOSED: [2015-10-27 Tue 18:43] :LOGBOOK: CLOCK: [2015-10-27 Tue 17:32]--[2015-10-27 Tue 17:32] =>  0:00
*** DONE [#3] [1/1] Improve error messages (up to another day of time commitment is acceptable)
CLOSED: [2015-11-04 Wed 12:52]
**** DONE [#3] Go over error messages with Regina
CLOSED: [2015-11-04 Wed 12:52]
*** DONE [#1] [5/5] ErrorLinkyThing/ClickableConsole 
CLOSED: [2015-11-04 Wed 15:46]
**** DONE [#1] [1/1] Package up Lite with ErrorLinkyThing for Regina's testing.
CLOSED: [2015-10-30 Fri 15:16]
***** DONE [#2] When ready, deal with licensing setup for ErrorLinkyThing.
CLOSED: [2015-10-29 Thu 13:05]
**** DONE [#1] Commit updated plugin changes to Lingoport owned github..
CLOSED: [2015-10-30 Fri 15:42] DEADLINE: <2015-10-30 Fri>
***** DONE [#1] Share github repo with lp_? linda, lori, olivier
CLOSED: [2015-11-02 Mon 
0:46]
**** DONE [#1] Remove debug messages
CLOSED: [2015-11-02 Mon 17:06]
**** done [#1] [2/2] Test that ClickableConsole works for Relevant version of:
CLOSED: [2015-11-09 Mon 14:02]
***** done Eclipse 
CLOSED: [2015-11-04 Wed 15:46]
***** done Java (7 and 8)
CLOSED: [2015-11-04 Wed 15:46]
**** DONE [#1] Check in about what plugin details we want to change for ErrorLinkyThing, then change them
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
*** DONE [#4] [6/6] Pre-release licensing stuff for Lite
CLOSED: [2015-11-11 Wed 19:14]
**** DONE [#2] Licenses retrieved for all but a few
**** DONE [#2] Check up on a last few difficult licenses
CLOSED: [2015-10-29 Thu 12:57]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:53]--[2015-10-29 Thu 12:57] =>  0:04
CLOCK: [2015-10-29 Thu 12:07]--[2015-10-29 Thu 12:18] =>  0:11
:END:
**** DONE [#2] Put the licenses somewhere.
**** DONE [#2] Insure all links to licenses work.
CLOSED: [2015-10-29 Thu 12:52]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:42]--[2015-10-29 Thu 12:52] =>  0:10
CLOCK: [2015-10-29 Thu 12:37]--[2015-10-29 Thu 12:40] =>  0:03
:END:
**** DONE [#2] Putting the Lingoport license in with Lite
CLOSED: [2015-11-02 Mon 17:19]
***** DONE [#2] Need some license changes confirmed
CLOSED: [2015-11-02 Mon 17:07]
***** CANC [#2] Link to the open source licenses from the license file.
CLOSED: [2015-11-02 Mon 17:07]
****** No link necessary. I did mention their relative location though.
***** DONE [#3] Confirm naming / directory conventions.
CLOSED: [2015-11-03 Tue 10:19]
****** DONE [#3] Put everything in a "license" directory
CLOSED: [2015-11-03 Tue 16:42]
**** CANC [#1] Put Lite's License up on our website (somewhere?)
CLOSED: [2015-11-06 Fri 14:07] DEADLINE: <2015-11-06 Fri>
*** CANC [#3] [2/2] Junit                                    :status meeting:
CLOSED: [2015-11-04 Wed 10:52]
**** DONE [#1] Some tests fail.
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
This is due to lagging behind current refactoring. It doesn't indicate a program
problem. However, I should still probably refactor these.
**** CANC [#3] Add more coverage.
CLOSED: [2015-11-04 Wed 10:52]
*** DONE [#3] Refactor eclipse-standard location
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
**** DONE [#1] Remove eclipse-enhanced, intellij, just use gnu (Update bug (5160?) with latest changes)
CLOSED: [2015-11-03 Tue 20:07]
*** DONE [#1] [4/4] Internal Docs                            :status meeting:
CLOSED: [2015-11-12 Thu 14:07]
**** done [#2] Regina's doc updates
CLOSED: [2015-10-30 Fri 15:02]
***** DONE [#1] Proof new version
CLOSED: [2015-10-30 Fri 18:11]
****** DONE [#2] Verify that there aren't other tweaks that Regina isn't aware of
CLOSED: [2015-10-30 Fri 18:11]
**** DONE [#1] Update --console-output "eclipse" eclipse screenshot.
CLOSED: [2015-11-02 Mon 17:47]
**** CANC [#1] Make the distinction between ScanSelectedItem and ScanParentDirectory clearer
CLOSED: [2015-10-27 Tue 11:57]
This may not have been clear to Michael Chen
**** DONE [#1] [9/9] Document use of plugin for Lite
CLOSED: [2015-11-12 Thu 14:07] DEADLINE: <2015-11-06 Fri>
***** DONE [#3] Change Plugin Name
CLOSED: [2015-10-29 Thu 20:44] DEADLINE: <2015-10-29 Thu>
***** DONE [#1] Get the Plugin Working Again! 
CLOSED: [2015-10-30 Fri 13:08]
see: http://www.vogella.com/tutorials/EclipsePlugIn/article.html#deployplugin_overview
https://stackoverflow.com/questions/582391/installing-eclipse-3-4-plugins-in-a-directory-other-than-eclipse-home-plugins/582430#582430
***** DONE [#1] Double check that the new README is correct.
CLOSED: [2015-11-02 Mon 17:08]
***** DONE [#2] Look through help pages that aren't "globalyzer-lite-IDE-usage.html"
CLOSED: [2015-11-03 Tue 20:07]
***** DONE [#1] Re-doc change from eclipse-enhanced to gnu
CLOSED: [2015-11-04 Wed 15:47]
***** DONE [#1] Review Regina's changes
CLOSED: [2015-11-04 Wed 19:32]
***** DONE [#1] Re-Merge my changes with Regina's
CLOSED: [2015-11-04 Wed 19:32]
***** DONE [#1] Check that the Docs contains links to the demo videos
CLOSED: [2015-11-10 Tue 18:18]
***** DONE [#1] Doc review session. Need to fix merge stuff.
CLOSED: [2015-11-11 Wed 18:43] SCHEDULED: <2015-11-09 Mon 15:00>
*** DONE [#2] [0/0] Add missing "intellij_IDEA" option.
CLOSED: [2015-10-30 Fri 19:41] DEADLINE: <2015-10-30 Fri>
*** DONE [#1] [2/2] Any release Wrap up
CLOSED: [2015-11-13 Fri 14:07]
**** DONE [#1] Check organizations of files for unzipped jar file
CLOSED: [2015-11-12 Thu 14:07]
**** DONE [#1] [3/3] Confirm no bugs
CLOSED: [2015-11-13 Fri 14:07]
***** DONE [#1] Fix exit on scan failure bug
CLOSED: [2015-11-06 Fri 16:41] DEADLINE: <2015-11-06 Fri>
***** DONE [#1] Find and fig O's mystery nothing found bug.
CLOSED: [2015-11-11 Wed 18:47]
***** CANC [#1] Fix O's mystery nothing found bug
CLOSED: [2015-11-12 Thu 10:04] (Was not actually a bug - just rule set configuration)
** Lite post release
*** WAIT [#4] [0/1] Merge 4.8.5 into master. (Tell Regina first).
**** WAIT [#4] Send mail to everyone post-merge
*** regi [#4] Document requirements on testlink.
*** TODO [#5] Put licenses on wiki.
** Misc
*** DONE [#3] [0/0] Read more into, ask about design by contract.
CLOSED: [2015-10-28 Wed 00:33]
Ok that this setter-ish-thing doesn't accept null?
ProjectDetails.java:227 
addScan(@Nonnull Scan scan) { 
    if (scan == null) {
        return;
    }
    m_scans.add(scan
Answer: It's probably best to throw an error on null, but this is OK.
*** DONE [#2] [3/3] Look into lite encoding handing for UTF-16BE_NO_BOM
CLOSED: [2015-11-03 Tue 20:13]
**** DONE [#1] Remind Mary
CLOSED: [2015-10-30 Fri 15:09] DEADLINE: <2015-10-30 Fri>
:LOGBOOK:
CLOCK: [2015-10-30 Fri 15:06]--[2015-10-30 Fri 15:09] =>  0:03
:END:
Mary said that it's a good feature request. But didn't imply that it was a 
release showstopper.
**** DONE [#2] Get final confirmation from O that it's ok to release with said problem.
CLOSED: [2015-11-02 Mon 10:47]
**** DONE [#2] Add to bugzilla.
CLOSED: [2015-11-03 Tue 20:13]
* Misc
** TODO [#4] Set better svn password
* Competitors
** TODO [#6] Populate list
*** Pasolo
*** LRM competitor thing
*** Things mentioned by EMC
*** That startup company that wanted to view our demos
* Sales engineer stuff
** Pre-Sale
*** Client Demos
**** done [#5] Show kent grave sandbox pseudoloc.
CLOSED: [2015-11-09 Mon 14:52]
Ww-java -> commits -> lingoport pseudoloc automation.
    showing a commit (show this if he's more technical)
Say that you can configure
- Length
- Brackets
- Characters on different unicode bit-plains.
or
(if he's less technical)
Dashboard -> Project (not javademo) 
          -> issues 
          -> find issue
          -> components 
          -> ctrl-f locales 
          -> any one of them will have issues in eo, pseudolocalized
*** Client Meetings
*** Sandbox Setup
**** CANC [#1] Setup sandbox account for Rally
CLOSED: [2015-11-10 Tue 16:22] DEADLINE: <2015-11-10 Tue>
*** Answering questions
**** DONE Russ needs time estimate confirmation                :Blackbaud:
CLOSED: [2015-11-05 Thu 17:54] DEADLINE: <2015-11-05 Thu>
**** done [#1] (Olivier) Russ needs information about the Prep Kit setup :Blackbaud:
CLOSED: [2015-11-06 Fri 11:37] DEADLINE: <2015-11-06 Fri>
**** done [#2] Respond to Paypal's questions on feature requests :Paypal:
CLOSED: [2015-11-10 Tue 11:20] SCHEDULED: <2015-11-09 Mon>
**** WAIT [#2] Workbench only installation setup for Russ      :Blackbaud:
Use it doc at https://docs.google.com/document/d/1TFtXLVwBrnN6b_MgQOdY_2-FyA2wtc6noKcYem4I0l4
***** DONE [#2] Get Admin Access to the Globalyzer Server     :Blackbaud:
CLOSED: [2015-11-10 Tue 11:21]
**** DONE [#2] Write up installation details for Robert West        :Esri:
CLOSED: [2015-11-12 Thu 10:11]
*** Video
**** TODO [#4] Demo Video for whole suite.
***** WAIT [#4] Give out Deadline for demo video         :status meeting:
Time guestimate: 20-30 hours net.
***** DONE [#1] Buy Microphone on Amazon
CLOSED: [2015-11-09 Mon 11:29] DEADLINE: <2015-11-13 Fri>
*** Does User Facing
*** Clients
**** Amex
**** Air Watch (Owned by VmWare)
***** Need
****** Training
****** Code 18n (Globalyzer)
****** ?
***** Use
****** Languages:
******* Java (Android), Csharp, IOS (Objective C?, Swift?)
****** WorldServer for Translation
**** VmWare
** Post-Sale
*** Pilot setup
*** Install and config
*** Rule set config
*** LRM on-boarding
*** Follow-up
*** Lingotech Support
*** Customer Satisfaction
*** Clients
**** Esri
**** Blackboard
****** Net 
**** Intuit
**** Blackbaud [3/4]
***** DONE Email Russ requesting
CLOSED: [2015-11-04 Wed 15:29]
****** TFS repo access
****** GUI vpn connection
****** Any other reqs
****** Nomachine / esri setup
***** DONE Read about CLDR
CLOSED: [2015-11-04 Wed 17:22]
***** CANC [#2] Email Russ to check in                        :Blackbaud:
CLOSED: [2015-11-13 Fri 10:58]
***** WAIT [#2] [1/2] Setup Workbench installation for Blackbaud -- Most Important
Waiting on Russ's LDAP access 
- Their vendor is OnePlanet
  - Control.xml (gives metadata to OnePlanet)
****** WAIT [#2] Follow Instructions From Doc that Andrew sent
****** DONE [#2] Will need admin access to globalyzer.com (get password from Olivier)
CLOSED: [2015-11-12 Thu 10:07]
**** Intuit
***** Meeting w/ John O'Conner.
****** Gave up on build integration of Globalyzer.
****** John does have a team working with it.
****** John is going to pull the repositories daily.
****** Can Setup vpn access
******* adam [#1] Need a username (masnes, olibouban)
******* Will probably take 4-5 days
******* Server is headless
******* John is setting up workbench etc.
******* Is interested in LRM
******** Adam is giving them a free trial.
******** Want to push pseudolocalization, but need permission from devs to commit to code.
******* John likes us (Loyd too). They feel like we're going above and beyond.
******** Really annoyed with his developers.
******** Doesn't have much power over the developers.
******* John is slow to get things moving
******** Loyd is pressuring him though.
******* WAIT [#2] [0/2] Help John get Jenkins setup w/  
DEADLINE: <2015-11-16 Mon>
- [ ] Globalyzer (Lite?)
- [ ] LRM
**** EMC
***** TODO [#2] Attend Meetings
** Communication
*** Internal
**** DONE [#5] Confirm signature with Adam
CLOSED: [2015-11-07 Sat 14:59]
**** TODO [#4] Ask Adam about what I can/can't disclose. NDA stuff.
***** TODO [#4] Populate a list of things that I might want to disclose.
*** Drive request channelling
*** 2pm Friday
*** DONE [#1] Setup email signature
CLOSED: [2015-11-05 Thu 16:50] DEADLINE: <2015-11-05 Thu>
** TODO [#3] Look into stack installer                      :status meeting:
